Revit 2027 API
Face.EdgeLoops Property
A collection of edge loops. Each edge loop represents one of the closed boundaries of the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EdgeArrayArray EdgeLoops { get; }
Public ReadOnly Property EdgeLoops As EdgeArrayArray
	Get
public:
property EdgeArrayArray^ EdgeLoops {
	EdgeArrayArray^ get ();
}
member EdgeLoops : EdgeArrayArray with get
Property Value
EdgeArrayArray
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace